/**
 * @mainpage
 * # Загальне завдання
 * 1. **Реалізувати** функцію, що визначає, скільки серед заданої 
 * послідовності чисел таких пар, у котрих перше число менше наступного
 * @author Alekseenko N.
 * @date 05-dec-2020
 * @version 1.0
 */

/**
 * @file main.c
 * @brief Файл з демонстрацією роботи структури та методів
 * оперування ним.
 *
 * @author Alekseenko N.
 * @date 05-dec-2020
 * @version 1.0
 */

#include <stdarg.h>

/**
 * *Функція number*
 *
 * Послідовність дій:
 * - оголошеня змінних 
 *  \param n - змінна, яка покаже скільки чисел, в яких 1 цифра більше 2
 *  \param a - поточне число
 *  \param b - наступне число
 * - витягаємо перше число зі списку
 * - цикл попарного порівняння сусідніх чисел
 * - витягаємо наступне число зі списку
 * - закінчуємо роботу зі списком
 */

// функция для подсчета пар чисел в котором 1 число меньше следующего
// первый параметр задает к-во чисел
// сами числа передаються в последующих параметрах

int number(int count, ...)    
{
    va_list ap;         // специальная переменная для работы со списком параметров
    int j;
    int n = 0;
    int a = 0;
    int b = 0;

    va_start(ap, count);    // начинаем работу со списком параметров

    a = va_arg(ap, int);    // извлекаем первое число из списка


    for (j = 0; j < count - 1; j++)    // цикл попарного сравнения соседних чисел 
    {
        b = va_arg(ap, int);           // извлекаем следующее число из списка

        if ( a < b ) n++;  
        a = b;       
    }

    va_end(ap);          // заканчиваем работу со списком

    return n;
}

/**
 * *Головна функція.*
 *
 * Послідовність дій:
 * - вивід результату роботи функції *result*
 * @return успішний код повернення з програми (0)
 */

int main () 
{


    int n = 0;      // сколько чисел, в которых 1 цифра больше 2

    n = number(6, 15, 16, 61, 51, 17, 18);

    (void) n;       // вызов результата

    return 0;
}

    






