/**
 * @mainpage
 * # Загальне завдання
 * 1. **Заповнити масив** із заданої кількості елеметів простими числами, що не повторюються.
 * @author Alekseenko N.
 * @date 05-dec-2020
 * @version 1.0
 */

/**
 * @file main.c
 * @brief Файл з демонстрацією роботи структури та методів
 * оперування ним.
 *
 * @author Alekseenko N.
 * @date 05-dec-2020
 * @version 1.0
 */

#include <stdio.h>
#include <stdlib.h>

/**
 * *Функція result*
 *
 * Послідовність дій:
 * - оголошеня змінних 
 *  \param m[] - масив с цифрами
 * - вибір всих можливих дільників
 * - визначення чи являє собою задане число простим, якщо так, то запис у масив
 * - виконання циклу до заповнення масиву
 */

void result( int m[10] )
{
    int c = 0; 

    if (10 <= 0) 
    {
        exit(1);
    }

    for (int i = 2; i <= 10; i++)
    { 
        c = 0; 
        
        for (int z = 2; z < i; z++)
        {

            if (i % z == 0)
            {
                c = 1;
                break;
            }
        }
         
        if ( c == 0 )
        {
            
            m[i] = i;
        }       
    }
}

/**
 * *Головна функція.*
 *
 * Послідовність дій:
 * - вивід результату роботи функції *result*
 * @return успішний код повернення з програми (0)
 */

int main()
{

    int m[10] = {};
    
    result( m );

    return 0;
}