/**
 * @mainpage
 * # Загальне завдання
 * 1. **Визначити** кількість слів у заданому тексті
 * @author Alekseenko N.
 * @date 05-dec-2020
 * @version 1.0
 */

/**
 * @file main.c
 * @brief Файл з демонстрацією роботи структури та методів
 * оперування ним.
 *
 * @author Alekseenko N.
 * @date 05-dec-2020
 * @version 1.0
 */

#include <stdio.h>

/**
 * *Функція result*
 *
 * Послідовність дій:
 * - оголошеня змінних 
 *  \param words - кількість слів
 *  \param n - кількість символів в масиві
 *  \param m[] - змінна, в яку ми пишемо речення
 * - шукаємо кількість символів в масиві
 * - цикл для визначення кількості слів
 * - потім ми ігноруємо прогалини і правильно рахуємо слова
 */


int result( int words, int n, char m[] )
{
    while (m[n] != '\0') 
        {
            n++;                // ищу количество символов  в массиве
        }

        for (int i = 0; i < n; i++)        // цикл для определения количества слов
        {

            if (m[i] != ' ' && m[i + 1] <= ' ')     // здесь мы игнорируем пробелы и правильно считаем слова
            {
                words++;
            }
        }

    return words;
}

/**
 * *Головна функція.*
 *
 * Послідовність дій:
 * - вивід результату роботи функції *result*
 * @return успішний код повернення з програми (0)
 */

int main() 
{
        int words = 0;          // количество слов
        int n = 0;              // количество символов в массиве 
        char m[] = "Counter Strike Global Offensive";  // переменная, в которую мы пишем предложение

        words = result( words, n, m );


        printf("%d\n", words );

     	return 0;
}
