/**
 * @mainpage
 * # Загальне завдання
 * 1. **Визначити**, чи э квіток щасливим (сумма першої половини 6-значного числа дорівнює суммі другої)
 * @author Alekseenko N.
 * @date 05-dec-2020
 * @version 1.0
 */

/**
 * @file main.c
 * @brief Файл з демонстрацією роботи структури та методів
 * оперування ним.
 *
 * @author Alekseenko N.
 * @date 05-dec-2020
 * @version 1.0
 */

#include <stdlib.h>
#include <time.h>

/**
 * *Функція result*
 *
 * Послідовність дій:
 * - оголошеня змінних 
 *  \param a1 - сумма першої половини чисел
 *  \param a2 - сумма другої половини чисел
 *  \param b - змінна для виведення результату
 *  \param х - число, яке ми будемо перевіряти
 * - знаходимо перші 3 числа та рахуємо їх сумму
 * - знаходимо останні 3 числа та рахуємо їх сумму
 * - зрівнюємо а1 та а2, отримуємо результат
 */

int result(int x)
{
    int a1 = 0;
    int a2 = 0;
    int b = 0;

    for ( int i = 1; i < 4; i++ )
    {
        a1 = a1 + ( x % 10 );
        x /= 10;
    }


    for ( int i = 1 ; i < 4; i++ )
    {
        a2 = a2 + ( x % 10 );
        x /= 10;
    }


    if ( a1 == a2 ) 
    {
        b = 2; // если билет счастливый
    } 
    else 
    {
        b = 1; // если билет несчатливый
    }  

    return b;
} 

/**
 * *Головна функція.*
 *
 * Послідовність дій:
 * - вивід результату роботи функції *result*
 * @return успішний код повернення з програми (0)
 */

int main () 
{

    srand ( time(NULL) );

    int x = rand() % 1000000;
    int b = 0;

    b = result(x);

    return 0;
}

    






