/**
 * @mainpage
 * # Загальне завдання
 * 1. Дано двовимірний масив NxN цілих чисел. **Помножити матрицю** саму на себе
 * @author Alekseenko N.
 * @date 05-dec-2020
 * @version 1.0
 */

/**
 * @file main.c
 * @brief Файл з демонстрацією роботи структури та методів
 * оперування ним.
 *
 * @author Alekseenko N.
 * @date 05-dec-2020
 * @version 1.0
 */

#define N 3             // задаем константу (размерность матрицы) 

/**
 * *Функція result*
 *
 * Послідовність дій:
 * - оголошеня змінних 
 *  \param N - розмірність матриці
 *  \param matr[N][N] - створюємо матрицю N-го порядку
 *  \param final[N][N] - змінна для результату
 * - робимо цикл для знаходження квадрата матриці
 * - чистимо final від сміття
 * - знаходимо множення матриці на неї ж.
 */

void result( int matr[N][N], int final[N][N])
{
    
    for (int i = 0; i < N; i++)         // цикл для нахождения квадрата матрицы 
    {
        for (int j = 0; j < N; j++) 
        {
            final[i][j] = 0;           // чистим final от мусора

            for(int k = 0; k < N; k++) 
            {
                final[i][j] += matr[i][k] * matr[k][j];   // находим умножение матрицы на нее же.
            }
        }
    }


}

/**
 * *Головна функція.*
 *
 * Послідовність дій:
 * - вивід результату роботи функції *result*
 * @return успішний код повернення з програми (0)
 */

int main()
{
    
    int matr[N][N] = {      // создаем матрицу N-го порядка
        {1, 4, 7},
        {2, 5, 8},
        {3, 6, 9},
    };                      

    int final[N][N];        // переменная для результата
    
    result ( matr, final );

    return 0;
}