/**
 * @mainpage
 * # Загальне завдання
 * 1. Дано двовимірний масив з NxN цілих чисел. **Виконати циклічне зрушення**
 * @author Alekseenko N.
 * @date 05-dec-2020
 * @version 1.0
 */

/**
 * @file main.c
 * @brief Файл з демонстрацією роботи структури та методів
 * оперування ним.
 *
 * @author Alekseenko N.
 * @date 05-dec-2020
 * @version 1.0
 */

#include <stdio.h>
#include <stdlib.h>
#include <time.h>

#define N 3             // задаем константу (размерность матрицы)  

/**
 * *Функція result*
 *
 * Послідовність дій:
 * - оголошеня змінних 
 *  \param N - розмірність матриці
 *  \param m[N][N] - створюємо матрицю N-го порядку
 *  \param i - рядки матриці
 *  \param j - стовпці матриці
 *  \param x - змінна для зсуву
 * - вибір одного з масиву
 * - потім робимо цикл переставлення елементів матриць
 * - а потім, х записує значення першого елемента в останній елемент матриці
 */

void result( int m[N][N] )
{
	int i = 0;              // строки матрицы
    int j = 0;              // столбцы матрицы
    int x = 0;              // переменная для сдвига 

    srand ( time(NULL) );

    for ( i = 0; i < N; i++) 
    {
        for ( j = 0; j < N; j++)
        {
         m[i][j] = rand() % 10;
        }    
    }


    for ( i=0; i < N; i++ )         // выбор одного из массива
    {
        x = m[i][0];                // х сохраняет значение первого элемента матрицы
        for ( j=0; j < N; j++ )     // цикл переставления элементов матриц
        {
        m[i][j] = m[i][j+1];
        }  
        m[i][N-1] = x;              // х записывает значение первого элемента в последний элемент матрицы
    }
}

/**
 * *Головна функція.*
 *
 * Послідовність дій:
 * - вивід результату роботи функції *result*
 * @return успішний код повернення з програми (0)
 */

int main()
{   
    int m[N][N]; 
                                                // создаем матрицу N-го порядка    

    result ( m );

    return 0;

}